

def transplant(x, y) -> str:
    """
    Определяет действие с деревом или кустарником (удаление или пересадка)
    Args:
        ...
    Returns:
        str: Удаление/Пересадка
    """
    # TODO: Добавить фильтр
    return 'Пересадка'


def calc_landings(x, y) -> str:
    """
    Определяет количество посадок
    Args:
        x:
        y:

    Returns:
        str: Строка расчета посадок
    """
    # TODO: Добавить фильтр
    # TODO: Что делать если у стволов одного дерева разные состояния
    return '...= N посадок'


def calc_payments(x, y) -> str:
    """
    Определяет сумму выплат
    Args:
        x:
        y:

    Returns:
        str: Строка расчета выплат
    """
    # TODO: Добавить фильтр
    # TODO: Что делать если у стволов одного дерева разные состояния
    return '...= N выплат'
